roam/a_roomba_recorded_a_woman_on_the_toilet.org
:PROPERTIES:
:ID:       6d254c53-a5bf-48d3-b0e9-b5c006e8d944
:END:
#+title: A Roomba recorded a woman on the toilet
#+date: [2024-01-31 Wed 04:54]
#+filetags: article
- Source: https://www.technologyreview.com/2022/12/19/1065306/roomba-irobot-robot-vacuums-artificial-intelligence-training-data-privacy/
- Author: Eileen Guo
- Related: [[id:aafe5e97-812c-4ffe-9b0c-5f8f99e607ee][Ethics]], [[id:29545128-07cf-4918-8988-9ed11bb1e684][Etica, Società e Privacy]]
  + [[https://www.welivesecurity.com/en/privacy/gathering-dust-and-data-how-robotic-vacuums-can-spy-on-you/][welivesecurity article]]

* Notes
- photos of people leaked
  + various states of undress
  + underage children
  + uncensored faces
- leaked by third party contract workers for data labeling
  + violation that is bound to happen when independent workers try to collaborate on the web to raise productivity
- corporation says the robot owners signed the /terms of service/
  + of course these terms are vague on all the steps of data treatment
  + users should not only be able to read the terms but /understand them/
    - the complications of privacy are not easily understood by most people
  + weird phrasing and distinctions (no data selling $\neq$ no data sharing)
- corporations have the data treated by third parties to raise productivity
  + third party is not easily controlled
  + internal data treatment can be protected and controlled through =NDAs= and corporation policy
    - would be the most privacy-safe procedure
- hacker found functionalities to /upload/ data even in products of which terms of service only defined data treatment as local
  + should the corporation be blindly trusted?
- corporations argue that facial data is necessary to develop AI tools to then automatically censor them in future data collection
  + facial data may not be strictly needed
  + silhouette data may be all that's needed
  + synthetic data should be the norm, not user data
- users are much more likely to accept data collection if a cute little robot is what's collecting and treating the data, in reality the data gets treated by humans in third world countries often
* Q/E/C
- [[id:d289e315-db0d-4166-9bd1-8df2c0ab31a5][Do users understand what happens to their data?]]
- [[id:c5f6283d-4ec9-48a7-8079-e233a749144e][What is the best way to treat sensitive data?]]
