content/posts/a_roomba_recorded_a_woman_on_the_toilet.md
+++
title = "A Roomba recorded a woman on the toilet"
author = ["Daniel Biasiotto"]
date = 2024-01-31T04:54:00+01:00
tags = ["article"]
draft = false
+++

-   Source: <https://www.technologyreview.com/2022/12/19/1065306/roomba-irobot-robot-vacuums-artificial-intelligence-training-data-privacy/>
-   Author: Eileen Guo
-   Related: [Ethics]({{< relref "ethics.md" >}}), [Etica, Società e Privacy]({{< relref "etica_societa_e_privacy.md" >}})
    -   [welivesecurity article](https://www.welivesecurity.com/en/privacy/gathering-dust-and-data-how-robotic-vacuums-can-spy-on-you/)


## Notes {#notes}

-   photos of people leaked
    -   various states of undress
    -   underage children
    -   uncensored faces
-   leaked by third party contract workers for data labeling
    -   violation that is bound to happen when independent workers try to collaborate on the web to raise productivity
-   corporation says the robot owners signed the _terms of service_
    -   of course these terms are vague on all the steps of data treatment
    -   users should not only be able to read the terms but _understand them_
        -   the complications of privacy are not easily understood by most people
    -   weird phrasing and distinctions (no data selling \\(\neq\\) no data sharing)
-   corporations have the data treated by third parties to raise productivity
    -   third party is not easily controlled
    -   internal data treatment can be protected and controlled through `NDAs` and corporation policy
        -   would be the most privacy-safe procedure
-   hacker found functionalities to _upload_ data even in products of which terms of service only defined data treatment as local
    -   should the corporation be blindly trusted?
-   corporations argue that facial data is necessary to develop AI tools to then automatically censor them in future data collection
    -   facial data may not be strictly needed
    -   silhouette data may be all that's needed
    -   synthetic data should be the norm, not user data
-   users are much more likely to accept data collection if a cute little robot is what's collecting and treating the data, in reality the data gets treated by humans in third world countries often


## Q/E/C {#q-e-c}

-   [Do users understand what happens to their data?]({{< relref "do_users_understand_what_happens_to_their_data.md" >}})
-   [What is the best way to treat sensitive data?]({{< relref "what_is_the_best_way_to_treat_sensitive_data.md" >}})
